tap "homebrew/bundle"
tap "homebrew/core"
brew "util-linux"
brew "sqlite"
brew "apr-util"
brew "openldap"
brew "curl"
brew "fontconfig"
brew "gd"
brew "python@3.9"
brew "glib"
brew "libpq"
brew "libxslt"
brew "neovim"
brew "nghttp2"
brew "node"
brew "php"
brew "vifm"
