tap "browsh-org/browsh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "php"
brew "composer"
brew "openjdk"
brew "dex2jar"
brew "fzf"
brew "gcc"
brew "gradle"
brew "lazygit"
brew "python@3.9"
brew "macvim"
brew "mysql-client"
brew "neovim"
brew "nkf"
brew "node"
brew "nodebrew"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "tmux"
brew "vifm"
brew "vim", link: false
brew "xcodegen"
brew "yarn"
cask "1password6"
cask "android-studio"
cask "docker"
cask "dropbox"
cask "forklift"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "slack"
cask "stoplight-studio"
cask "visual-studio-code"
