tap "browsh-org/browsh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mono0926/license-plist"
brew "apktool"
brew "python@3.9"
brew "carthage"
brew "cmake"
brew "composer"
brew "dex2jar"
brew "gcc"
brew "libevent"
brew "freetds"
brew "fzf"
brew "geos"
brew "numpy", link: false
brew "gdal"
brew "gmt"
brew "unbound"
brew "gnutls"
brew "go"
brew "gradle"
brew "httrack"
brew "lazygit"
brew "mysql-client"
brew "neovim"
brew "nkf"
brew "node"
brew "nodebrew"
brew "peco"
brew "php"
brew "proj"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "tmux"
brew "vifm"
brew "vim"
brew "xcodegen"
brew "yarn"
brew "mono0926/license-plist/license-plist"
cask "1password"
cask "dropbox"
cask "firefox-developer-edition"
cask "forklift"
cask "freemind"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "iterm2"
cask "java8"
cask "macvim"
cask "skype"
cask "slack"
cask "stoplight-studio"
cask "typora"
cask "visual-studio-code"
