{
  "Comment.nvim": { "branch": "master" },
  "darcula": { "branch": "master" },
  "editorconfig-vim": { "branch": "master" },
  "eskk.vim": { "branch": "master" },
  "gist-vim": { "branch": "master" },
  "hz_ja.vim": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lualine.nvim": { "branch": "master" },
  "nvim-surround": { "branch": "main" },
  "nvim-tree.lua": { "branch": "master" },
  "nvim-web-devicons": { "branch": "master" },
  "open-browser.vim": { "branch": "master" },
  "previm": { "branch": "master" },
  "vim-abolish": { "branch": "master" },
  "vim-markdown": { "branch": "master" },
  "vim-matchup": { "branch": "master" },
  "vim-qfreplace": { "branch": "master" },
  "vim-toml": { "branch": "main" },
  "webapi-vim": { "branch": "master" }
}
