# Homebrew Bundle設定ファイル
# 参考: https://brew.sh/
# 参考: https://github.com/Homebrew/homebrew-bundle

# Homebrewリポジトリ（Tap）
tap "browsh-org/browsh"        # Browshターミナルブラウザ
tap "homebrew/bundle"          # Bundle機能
tap "homebrew/cask"            # GUI アプリケーション
tap "homebrew/cask-versions"   # 複数バージョンのアプリ
tap "homebrew/core"            # コアパッケージ

# コマンドラインツール
brew "bat"       # cat代替（シンタックスハイライト付き）
brew "openjdk"   # OpenJDK Java開発キット
brew "curl"      # データ転送ツール
brew "fd"        # find代替（高速検索）
brew "fzf"       # ファジーファインダー
brew "gcc"       # GNU Compiler Collection
brew "git-lfs"   # Git Large File Storage
brew "jq"        # JSON処理ツール
brew "lazygit"   # Git用TUIクライアント
brew "neovim"    # 現代的なVim
brew "ripgrep"   # 高速grep代替
brew "starship"  # 高速プロンプト
brew "tmux"      # ターミナルマルチプレクサ
brew "tree"      # ディレクトリ構造表示
brew "vifm"      # Vimライクファイルマネージャー

# GUI アプリケーション
cask "alacritty"          # 高速ターミナルエミュレータ
cask "brave-browser"      # プライバシー重視Webブラウザ
cask "docker"             # コンテナ仮想化プラットフォーム
cask "google-japanese-ime" # Google日本語入力
cask "intellij-idea"      # Java統合開発環境
cask "macvim"             # macOS用Vim
cask "slack"              # チームコミュニケーションツール
cask "visual-studio-code" # コードエディタ

# Visual Studio Code拡張機能
vscode "asvetliakov.vscode-neovim"                    # Neovim統合
vscode "bradlc.vscode-tailwindcss"                    # Tailwind CSS支援
vscode "dart-code.dart-code"                          # Dart言語支援
vscode "dart-code.flutter"                            # Flutter開発支援
vscode "ms-azuretools.vscode-docker"                  # Docker統合
vscode "ms-ceintl.vscode-language-pack-ja"            # 日本語言語パック
vscode "ms-python.debugpy"                            # Pythonデバッガー
vscode "ms-python.isort"                              # Pythonインポート整理
vscode "ms-python.python"                             # Python言語支援
vscode "ms-python.vscode-pylance"                     # Python言語サーバー
vscode "ms-toolsai.jupyter-keymap"                    # Jupyterキーマップ
vscode "ms-vscode-remote.remote-containers"           # リモートコンテナ開発
vscode "ms-vscode-remote.remote-ssh"                  # SSH リモート開発
vscode "ms-vscode-remote.remote-ssh-edit"             # SSH設定編集
vscode "ms-vscode-remote.remote-wsl"                  # WSL統合
vscode "ms-vscode-remote.vscode-remote-extensionpack" # リモート開発拡張パック
vscode "ms-vscode.remote-explorer"                    # リモートエクスプローラー
vscode "ms-vscode.remote-server"                      # リモートサーバー
vscode "rokoroku.vscode-theme-darcula"                # Darculaテーマ
vscode "svelte.svelte-vscode"                         # Svelte言語支援
vscode "xdebug.php-debug"                             # PHPデバッガー
