tap "browsh-org/browsh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
brew "apr-util"
brew "cocoapods"
brew "composer"
brew "curl"
brew "fzf"
brew "gcc"
brew "gradle"
brew "krb5"
brew "lazygit"
brew "libfido2"
brew "libpq"
brew "mysql-client"
brew "neovim"
brew "nkf"
brew "node"
brew "nodebrew"
brew "openjdk"
brew "openldap"
brew "perl"
brew "php"
brew "pyenv"
brew "python@3.10"
brew "rbenv"
brew "ripgrep"
brew "ruby-build"
brew "sqlite"
brew "tmux"
brew "tree"
brew "vifm"
brew "xcodegen"
brew "yarn"
cask "1password6"
cask "alacritty"
cask "android-studio"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "forklift"
cask "google-chrome"
cask "google-japanese-ime"
cask "intellij-idea"
cask "macvim"
cask "slack"
cask "stoplight-studio"
cask "visual-studio-code"
cask "zoom"
